function გაფილტრე(სია, უნდა_ავიღო_ელემენტი) {
    const გაფილტრული_სია = [];
    for (const ელემენტი of სია) {
        if (უნდა_ავიღო_ელემენტი(ელემენტი)) {
            გაფილტრული_სია.push(ელემენტი);
        }
    }   
    return გაფილტრული_სია;
}


console.log(
    გაფილტრე(
        [5, 6, 7, 8], 
        ელემენტი => ელემენტი % 2 === 0
    )
);

console.log(
    გაფილტრე(
        [5, 6, 7, 8], 
        ელემენტი => ელემენტი % 2 === 1
    )
);

console.log(
    გაფილტრე(
        ["Nick", "Marry", "Jane", "John"], 
        ელემენტი => ელემენტი !== "John"
    )
);